src/test/resources/sample_sfdc_outbound.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <soapenv:Body>
  <notifications xmlns="http://soap.sforce.com/2005/09/outbound">
   <OrganizationId>00DQ0000000EB93</OrganizationId>
   <ActionId>04kV0000000CaSPIA0</ActionId>
   <SessionId xsi:nil="true"/>
   <EnterpriseUrl>https://cs12-api.salesforce.com/services/Soap/c/23.0/00DV00000000dS3</EnterpriseUrl>
   <PartnerUrl>https://cs12-api.salesforce.com/services/Soap/u/23.0/00DV00000000dS3</PartnerUrl>
   <Notification>
    <Id>04lV0000001ALshIAG</Id>
    <sObject xsi:type="sf:Opportunity" xmlns:sf="urn:sobject.enterprise.soap.sforce.com">
     <sf:Id>006Q0000009N3gf</sf:Id>
     <sf:AccountId>001Q000000SvOoG</sf:AccountId>
     <sf:Billing_Contact_Email__c>Test email value</sf:Billing_Contact_Email__c>
    </sObject>
   </Notification>
  </notifications>
 </soapenv:Body>
</soapenv:Envelope>